In [1]:

import pandas as pd
import numpy as np

### Pandas

#### Series

In [2]:
data=pd.Series(np.random.randint(10,size=6))

In [3]:
data

0    5
1    2
2    2
3    7
4    7
5    1
dtype: int32

In [4]:
data=pd.Series(np.random.randint(10,size=5), index= list("ABCDE"))
data

A    9
B    8
C    2
D    1
E    9
dtype: int32

In [5]:
data.index, data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([9, 8, 2, 1, 9]))

In [6]:
data["B"]

8

In [7]:
data*10
#data

A    90
B    80
C    20
D    10
E    90
dtype: int32

In [8]:
data[["B","C"]]

B    8
C    2
dtype: int32

In [9]:
data[:2], data[::-1]

(A    9
 B    8
 dtype: int32, E    9
 D    1
 C    2
 B    8
 A    9
 dtype: int32)

In [10]:
data2= pd.Series({"E":10,"F":30})
data2

E    10
F    30
dtype: int64

In [11]:
#시리즈끼리 더하면 같은인덱스끼리 더해진다. 
data3=data+data2
data3

A     NaN
B     NaN
C     NaN
D     NaN
E    19.0
F     NaN
dtype: float64

In [12]:
#data3에 없는것은 data에서 가져와서 넣는다
data3[data3.isnull()]=data
data3

A     9.0
B     8.0
C     2.0
D     1.0
E    19.0
F     NaN
dtype: float64

In [13]:
data3[data3.isnull()]=data2
data3

A     9.0
B     8.0
C     2.0
D     1.0
E    19.0
F    30.0
dtype: float64

### 2. DataFrame

In [ ]:
#데이터 프레임 생성방법 1: 열별로 입력하기

In [92]:
datas={
    "Name":["andy","grace"],
    "Email":["andy@gmail.com","grace@hotmail.com"]
}
datas

{'Name': ['andy', 'grace'], 'Email': ['andy@gmail.com', 'grace@hotmail.com']}

In [93]:
df=pd.DataFrame(datas)

In [94]:
df

    Name              Email
0   andy     andy@gmail.com
1  grace  grace@hotmail.com

In [30]:
#데이터 프레임 생성방법 2: 행별로 입력하기
datas=[
    {"Name":"andy", "Email": 'andy@gmail.com'},
     {"Name":"grace", "Email": 'grace@hotmail.com'}
]

In [31]:
df=pd.DataFrame(datas)

In [32]:
df

               Email   Name
0     andy@gmail.com   andy
1  grace@hotmail.com  grace

In [35]:
df=pd.DataFrame(datas, index=['one','two'])

In [45]:
df

                 Email   Name
one     andy@gmail.com   andy
two  grace@hotmail.com  grace

In [46]:
df.columns

Index(['Email', 'Name'], dtype='object')

In [47]:
df.values

array([['andy@gmail.com', 'andy'],
       ['grace@hotmail.com', 'grace']], dtype=object)

In [51]:
#하나의 행만 출력
df.loc['two']

Email    grace@hotmail.com
Name                 grace
Name: two, dtype: object

In [52]:
datas={
    "Name":["andy","grace"],
    "Email":["andy@gmail.com","grace.hotmail.com"]
}
datas

df=pd.DataFrame(datas)
df

    Name              Email
0   andy     andy@gmail.com
1  grace  grace.hotmail.com

In [53]:
#칼럼 추가하기
df['ID']=""
df

    Name              Email ID
0   andy     andy@gmail.com
1  grace  grace.hotmail.com

In [55]:
df["ID"]=['A', 'B']

In [56]:
df

    Name              Email ID
0   andy     andy@gmail.com  A
1  grace  grace.hotmail.com  B

In [58]:
# 칼럼 순서바꾸기
df[["ID","Name","Email"]]

  ID   Name              Email
0  A   andy     andy@gmail.com
1  B  grace  grace.hotmail.com

In [90]:
df=df[["ID","Name","Email"]]
df

  ID   Name              Email
0  A   andy     andy@gmail.com
1  B  grace  grace.hotmail.com

### 3. apply 함수
- map 함수와 비슷한 역할을 해주는 함수

In [95]:
def domain(email):
    return email.split('@')[1].split(".")[0]

In [96]:
domain('andy@hotmail.com')

'hotmail'

In [97]:
df

    Name              Email
0   andy     andy@gmail.com
1  grace  grace@hotmail.com

In [98]:
df['Domain']=df['Email'].apply(domain)

In [99]:
df

    Name              Email   Domain
0   andy     andy@gmail.com    gmail
1  grace  grace@hotmail.com  hotmail

In [100]:
# append 데이터 프레임 합치기

from makedata import *

In [101]:
get_name()

'Alvin'

In [102]:
get_age()

36

In [108]:
df1=pd.DataFrame(make_data(5))
df1

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy

In [109]:
df2=pd.DataFrame(make_data(5))
df2

   Age    Name
0   34    Adam
1   38     Jin
2   24    Alex
3   34     Jin
4   21  Arnold

In [120]:
# append: 데이터 프레임 합치기
df3= df1.append(df2)
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
0   34     Adam
1   38      Jin
2   24     Alex
3   34      Jin
4   21   Arnold

In [124]:
#인덱스 재정렬
#단 객체를 바꾼것이 아니라 재정렬해서 return한 것 
#인덱스 열을 보통의 자료열로 올린다
df3.reset_index()

   index  Age     Name
0      0   29  Anthony
1      1   37      Jin
2      2   27  Anthony
3      3   37   Anchal
4      4   38    Billy
5      0   34     Adam
6      1   38      Jin
7      2   24     Alex
8      3   34      Jin
9      4   21   Arnold

In [122]:
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
0   34     Adam
1   38      Jin
2   24     Alex
3   34      Jin
4   21   Arnold

In [123]:
df3.reset_index(drop=True)
#인덱스 열을 보통의 자료열로 올리는게 아니라 그냥 버린다

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
5   34     Adam
6   38      Jin
7   24     Alex
8   34      Jin
9   21   Arnold

In [125]:
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
0   34     Adam
1   38      Jin
2   24     Alex
3   34      Jin
4   21   Arnold

In [133]:
df3.index=range(1,11)
df3

    Age     Name
1    29  Anthony
2    37      Jin
3    27  Anthony
4    37   Anchal
5    38    Billy
6    34     Adam
7    38      Jin
8    24     Alex
9    34      Jin
10   21   Arnold

In [134]:
#inplace= 바꾸고 다시 넣어준다
df3.reset_index(drop=True, inplace=True)

In [135]:
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
5   34     Adam
6   38      Jin
7   24     Alex
8   34      Jin
9   21   Arnold

In [136]:
#ignore_index=True 하면 인덱스 빼고 추가되며, 자동으로 인덱스를 매긴다
#따라서 drop=True, inplace=True 안해도 된다
df3=df1.append(df2, ignore_index=True)
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
5   34     Adam
6   38      Jin
7   24     Alex
8   34      Jin
9   21   Arnold

### 5. concat
- row나 column으로 데이터 프레임을 합칠 때 사용

In [137]:
#세로로 합치기
df3= pd.concat([df1,df2])

In [138]:
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
0   34     Adam
1   38      Jin
2   24     Alex
3   34      Jin
4   21   Arnold

In [140]:
df3=pd.concat([df1,df2]).reset_index(drop=True)
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
5   34     Adam
6   38      Jin
7   24     Alex
8   34      Jin
9   21   Arnold

In [148]:
#가로로 합치기
df4=pd.concat([df1,df2],axis=1)
df4

   Age     Name  Age    Name
0   29  Anthony   34    Adam
1   37      Jin   38     Jin
2   27  Anthony   24    Alex
3   37   Anchal   34     Jin
4   38    Billy   21  Arnold

In [149]:
# 합집합
df5=pd.concat([df3,df1],axis=1, join='outer')
df5

   Age     Name   Age     Name
0   29  Anthony  29.0  Anthony
1   37      Jin  37.0      Jin
2   27  Anthony  27.0  Anthony
3   37   Anchal  37.0   Anchal
4   38    Billy  38.0    Billy
5   34     Adam   NaN      NaN
6   38      Jin   NaN      NaN
7   24     Alex   NaN      NaN
8   34      Jin   NaN      NaN
9   21   Arnold   NaN      NaN

In [150]:
#교집합
df5=pd.concat([df3,df1],axis=1, join='inner')
df5

   Age     Name  Age     Name
0   29  Anthony   29  Anthony
1   37      Jin   37      Jin
2   27  Anthony   27  Anthony
3   37   Anchal   37   Anchal
4   38    Billy   38    Billy

### group by
- 특정컬럼의 중복되는 데이터를 합쳐서 새로운 데이터 프레임을 만드는 방법

In [161]:
df= pd.DataFrame(make_data())

In [162]:
df

   Age    Name
0   20    Adam
1   32    Alex
2   20    Alan
3   22   Alvin
4   34    Alex
5   28   Alvin
6   28    Adam
7   25    Alex
8   29    Alan
9   22  Anchal

In [163]:
#Size
df.groupby("Name").size()
#이름별로 묶어서 각각 몇개인지 나타낸다
#Series로 출력된다

Name
Adam      2
Alan      2
Alex      3
Alvin     2
Anchal    1
dtype: int64

In [164]:
#reset_index()로 새로운 인덱스를 달아준다.
#index가 달리면서 Series-> DataFrame으로 바뀐다
#각각 몇개인지는 칼럼이름 0으로 추가된다
df.groupby("Name").size().reset_index()

     Name  0
0    Adam  2
1    Alan  2
2    Alex  3
3   Alvin  2
4  Anchal  1

In [167]:
df=df.groupby("Name").size().reset_index(name='count')

In [168]:
df

     Name  count
0    Adam      2
1    Alan      2
2    Alex      3
3   Alvin      2
4  Anchal      1

In [170]:
# sort_values: 설정한 컬럼으로 데이터 프레임을 정렬
df.sort_values(["count"])

     Name  count
4  Anchal      1
0    Adam      2
1    Alan      2
3   Alvin      2
2    Alex      3

In [171]:
df.sort_values(["count"], ascending=False)

     Name  count
2    Alex      3
0    Adam      2
1    Alan      2
3   Alvin      2
4  Anchal      1

In [173]:
df.sort_values(["count"], ascending=False, inplace=True)
df

     Name  count
2    Alex      3
0    Adam      2
1    Alan      2
3   Alvin      2
4  Anchal      1

In [174]:
df.reset_index(drop=True, inplace=True)
df

     Name  count
0    Alex      3
1    Adam      2
2    Alan      2
3   Alvin      2
4  Anchal      1

In [ ]:
##agg() [size, mean, std, min, max]
#함수를 적용하여 집계

In [178]:
df3

   Age     Name
0   29  Anthony
1   37      Jin
2   27  Anthony
3   37   Anchal
4   38    Billy
5   34     Adam
6   38      Jin
7   24     Alex
8   34      Jin
9   21   Arnold

In [179]:
df3.groupby("Name").agg("min")

         Age
Name
Adam      34
Alex      24
Anchal    37
Anthony   27
Arnold    21
Billy     38
Jin       34

In [181]:
df3.groupby("Name").agg("min").reset_index()

      Name  Age
0     Adam   34
1     Alex   24
2   Anchal   37
3  Anthony   27
4   Arnold   21
5    Billy   38
6      Jin   34

In [183]:
# 데이터를 요약해서 보여주는 함수
df3.describe()

             Age
count  10.000000
mean   31.900000
std     6.226288
min    21.000000
25%    27.500000
50%    34.000000
75%    37.000000
max    38.000000